const wit_text1 = [
    'RISCかな配列とは',
    [
        'ローマ字入力を打ちやすく改良したのがRISCかな配列です。',
        'Google日本語入力のローマ字テーブルをカスタマイズすることで',
        'WindowsやmacOSで使えます。',
        '残念ながら、iOSやAndroidのIMEにはそのカスタマイズ機能がないので使えません。',
        '',
        '欠点は、覚える量が多いこと。',
        '配列を覚えるためのゲームがこれです。',
        'RISCかな配列の詳細については、下の「RISCかな配列のWikiホームを開く」へ。',
    ]
];

const wit_text2 = [
    'ゲームの進め方',
    [
        'ステージ画面の文章をRISCかな配列で打ち込むとステージクリア。',
        '打ち間違ったときは、そこから先が朱色の文字で出てきます。',
        '朱色の文字をBackspaceキーで消すと、間違える前に戻り、',
        '水色の文字で正解が表示されます。',
        '',
        'ステージ画面の文章はすべてWikipediaからの引用です。左下の画像は、',
        'その文章をプロンプトに、OpenAIのDALL-E 2で生成したものです。'
    ]
];

const wit_text3 = [
    'このゲームには出てこない実用知識',
    [
        'RISCかな配列では、Yキーに続けてローマ字が打てます。',
        'YPYAJUなら「ぴゃじゅｙ」、YLALYAなら「ぁゃｙ」が出ます。',
        '',
        'また、Google日本語入力のローマ字入力と同じく、',
        'ZLで「→」、Z/で「・」というように、Zキーから記号が打てます。',
        '',
        'これらの割当はこのゲームには出てきませんが、',
        'RISCかな配列を実用するときにはぜひ役立ててください。',
    ]
];

const wit_text4 = [
    '広告',
    [
        'RISCかな配列は、DecentKeyboardsの宣伝のために設計されました。',
        '',
        'DecentKeyboardsは、',
        '狭キーピッチ・ロープロファイルスイッチ用PBTキーキャップ Junana MX などを',
        '販売しているネットショップです。',
        '3Dプリンタで立体キーボードを試作するためのプラットフォーム P2PPCB や、',
        'キーキャップへの注文印刷も提供しています。',
    ]
];

export const wit_text = [wit_text1, wit_text2, wit_text3, wit_text4];
